#!/bin/bash

# Cкрипт, который будет выполнять следующую задачу: копировать все файлы с определенным расширением из одной директории в другую.

# 1.Запросить исходную и целевую директории у пользователя
# Описание: Запросить у пользователя указание исходной и целевой директорий.
# Действие: Предложить пользователю ввести пути к исходной и целевой директориям.
# Использовать следующие переменне: Исходная директория - source_directory 
# Целевая директория - target_directory

read -p "Введите путь к исходной директории: " source_directory
read -p "Введите путь к целевой директории: " target_directory


